---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook
source: html/46d3d7ac-7816-7436-4569-17c090bba0fb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook Property

Cannot set end treatment at an end that has hook.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarEndTreatmentOverHook { get; }
```